#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда

#Область СлужебныйПрограммныйИнтерфейс

// Структура загрузки.
// 
// Возвращаемое значение:
//  Структура - Реквизиты к загрузке:
// * Код - Строка
// * Наименование - Строка
Функция СтруктураЗагрузки() Экспорт
	Возврат Новый Структура("Код, Наименование", "", "");
КонецФункции

Функция НайтиЭлементСправочника(ЗначениеКлючевогоПоля) Экспорт
	Возврат 0;
КонецФункции 

Функция ИмяКлючевогоПоля() Экспорт
	Возврат "Код";
КонецФункции	

// Формат листа.
// 
// Возвращаемое значение:
//  Структура - Формат листа файла загрузки:
// * СтруктураКолонок - Структура - : ожидаемые имена колонок в листе
// * ОбъектМД - Строка - имя метаданных для диагностических сообщений
Функция ФорматЛиста() Экспорт
	
	ФорматЛиста = Новый Структура;
	ФорматЛиста.Вставить("СтруктураКолонок", СтруктураЗагрузки());
	ФорматЛиста.Вставить("ОбъектМД",		"Товары");
	
	Возврат ФорматЛиста;
	
КонецФункции	

// Преобразовать данные загрузки.
// 
// Параметры:
//  СтрокаЛистаФайла - СтрокаТаблицыЗначений - прочитано из файла
// 
// Возвращаемое значение:
//  Структура - Структура с подготовленными реквизитами для создания элемента справочника:
// * Код - Строка -
// * Наименование - Строка -
Функция ПреобразоватьДанныеЗагрузки(СтрокаЛистаФайла) Экспорт
	Реквизиты =	СтруктураЗагрузки();
	ЗаполнитьЗначенияСвойств(Реквизиты, СтрокаЛистаФайла);
	Возврат Реквизиты;
КонецФункции

#КонецОбласти

#КонецЕсли
