#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда

#Область СлужебныеПроцедурыИФункции

Функция ПараметрыОбработки(Знач Параметры)

	Результат = Новый Структура;
	Результат.Вставить("ДвоичныеДанные", Параметры.ДД);
	
	// Возвращаемая таблица с колонками Лист/ОбъектМД/количество загруженных объектов/ошибка загрузки
	ТаблицаРезультата = Новый ТаблицаЗначений;
	Результат.Вставить("ТаблицаРезультата", ТаблицаРезультата);
	
	ИменаЛистов = ИменаЛистовФайлаЗагрузки();
	Результат.Вставить("ИменаЛистов", ИменаЛистов);
	Результат.Вставить("КоличествоЛистов", 0);
	Результат.Вставить("ТекущееИмяЛиста", "");
	
	Возврат Результат;
	
КонецФункции // ПараметрыОбработки()
// 
// Возвращаемое значение:
//  Структура - Имена листов файла загрузки:
// * Товары - Структура - :
// ** СтруктураКолонок - Структура - :
// *** Код - Строка - 
// *** Наименование - Строка - 
// ** ОбъектМД - Строка - 
Функция ИменаЛистовФайлаЗагрузки()
	
	Результат = Новый Структура;
	Результат.Вставить("Товары", Справочники.Товары.ФорматЛиста());
	
	Возврат Результат;	
КонецФункции	

#КонецОбласти

#Иначе
  ВызватьИсключение НСтр("ru = 'Недопустимый вызов объекта на клиенте.'");
#КонецЕсли
